---
kind: method
id: M:Autodesk.Revit.DB.GuidEnum.Equals(System.Object)
source: html/7e78b321-b3c8-4283-875c-499d7de34acb.htm
---
# Autodesk.Revit.DB.GuidEnum.Equals Method

Compares two Guid-based enum object based on their concrete class and GUID value.

## Syntax (C#)
```csharp
public override bool Equals(
	Object obj
)
```

## Parameters
- **obj** (`System.Object`)